### Kaggle Tutorial Section 2 covering - Indexing, Selecting & Assigning

In [12]:
import pandas as pd

reviews = pd.read_csv("Meteorite_Landings.csv")
pd.set_option("display.max_rows", 10)

In [13]:
# Look at overview of the data

reviews.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.166670, -64.950000)"

In [14]:
# select the description column from reviews and assign to desc

desc = reviews['name']
desc

0            Aachen
1            Aarhus
2              Abee
3          Acapulco
4           Achiras
            ...
45711    Zillah 002
45712        Zinder
45713          Zlin
45714     Zubkovsky
45715    Zulu Queen
Name: name, Length: 45716, dtype: object

In [15]:
# desc is a panda series

type(desc)

pandas.core.series.Series

In [16]:
# Select the first value from the 'name' column of reviews, assigning it to variable first_name.

first_name= reviews['name'][0]
first_name

# reviews.name.iloc[0] OR reviews.name[0] OR reviews.name.loc[0] will also work

'Aachen'

In [17]:
# Select the first row of data (the first record) from reviews, assigning it to the variable first_row.

first_row = reviews.loc[0]
first_row

name                           Aachen
id                                  1
nametype                        Valid
recclass                           L5
mass (g)                           21
fall                             Fell
year           01/01/1880 12:00:00 AM
reclat                         50.775
reclong                       6.08333
GeoLocation     (50.775000, 6.083330)
Name: 0, dtype: object

In [18]:
# Select the first 10 names from the name column in reviews, assigning the result to variable first_name.

first_names= reviews.name[0:10]
first_names

# revews.['name'][:10]

0                 Aachen
1                 Aarhus
2                   Abee
3               Acapulco
4                Achiras
5               Adhi Kot
6    Adzhi-Bogdo (stone)
7                   Agen
8                 Aguada
9          Aguila Blanca
Name: name, dtype: object

In [19]:
x = desc.head(10)
x

0                 Aachen
1                 Aarhus
2                   Abee
3               Acapulco
4                Achiras
5               Adhi Kot
6    Adzhi-Bogdo (stone)
7                   Agen
8                 Aguada
9          Aguila Blanca
Name: name, dtype: object

In [20]:
# Select the records with index labels 1, 2, 3, 5, and 8, assigning the result to the variable sample_reviews.

indices = [1,2,3,4,5,8]
sample_reviews= reviews.iloc[indices]
sample_reviews

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.166670, -64.950000)"
5,Adhi Kot,379,Valid,EH4,4239.0,Fell,01/01/1919 12:00:00 AM,32.10000,71.80000,"(32.100000, 71.800000)"
8,Aguada,398,Valid,L6,1620.0,Fell,01/01/1930 12:00:00 AM,-31.60000,-65.23333,"(-31.600000, -65.233330)"

In [32]:
# create a variable df containing name, id, year and GeoLocation columns of records with indices 0,1,10,100.

df =  reviews[['name','id','year','GeoLocation']].iloc[[0,1,10,100]]
df

                 name    id                    year              GeoLocation
0              Aachen     1  01/01/1880 12:00:00 AM    (50.775000, 6.083330)
1              Aarhus     2  01/01/1951 12:00:00 AM   (56.183330, 10.233330)
10   Aioun el Atrouss   423  01/01/1974 12:00:00 AM   (16.398060, -9.570280)
100            Benton  5026  01/01/1949 12:00:00 AM  (45.950000, -67.550000)

Create a variable df containing the name and mass (g) columns of the first 100 records.

Hint: you may use loc or iloc. When working on the answer this question and the several of the ones that follow, keep the following "gotcha" described in the tutorial:

iloc uses the Python stdlib indexing scheme, where the first element of the range is included and the last one excluded. loc, meanwhile, indexes inclusively.

This is particularly confusing when the DataFrame index is a simple numerical list, e.g. 0,...,1000. In this case df.iloc[0:1000] will return 1000 entries, while df.loc[0:1000] return 1001 of them! To get 1000 elements using loc, you will need to go one lower and ask for

In [22]:
df = reviews[['name', 'mass (g)']].iloc[0:100]
df

           name  mass (g)
0        Aachen      21.0
1        Aarhus     720.0
2          Abee  107000.0
3      Acapulco    1914.0
4       Achiras     780.0
..          ...       ...
95    Benguerir   25000.0
96  Beni M'hira   19000.0
97        Benld    1770.5
98       Benoni    3880.0
99      Bensour   45000.0

[100 rows x 2 columns]

Manipulating the index¶
Label-based selection derives its power from the labels in the index. Critically, the index we use is not immutable. We can manipulate the index in any way we see fit.

The set_index() method can be used to do the job. Here is what happens when we set_index to the title field:
This is useful if you can come up with an index for the dataset which is better than the current one

In [23]:
# set index to 'id'
reviews.set_index('id')

,name,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
id,,,,,,,,,
1,Aachen,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775000, 6.083330)"
2,Aarhus,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.183330, 10.233330)"
6,Abee,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.216670, -113.000000)"
10,Acapulco,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.883330, -99.900000)"
370,Achiras,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.166670, -64.950000)"
...,...,...,...,...,...,...,...,...,...
31356,Zillah 002,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.03700,17.01850,"(29.037000, 17.018500)"
30409,Zinder,Valid,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.78333,8.96667,"(13.783330, 8.966670)"
30410,Zlin,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,49.25000,17.66667,"(49.250000, 17.666670)"
31357,Zubkovsky,Valid,L6,2167.0,Found,01/01/2003 12:00:00 AM,49.78917,41.50460,"(49.789170, 41.504600)"
30414,Zulu Queen,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333,"(33.983330, -115.683330)"

Conditional selection¶
So far we've been indexing various strides of data, using structural properties of the DataFrame itself. To do interesting things with the data, however, we often need to ask questions based on conditions.

For example, suppose that we're interested specifically in reclass L5 only or fall == Found ONLY.

We can start by checking if each reclass is L5 or not:

reviews.recclass == 'L5'

This operation produced a Series of True/False booleans based on the recclass of each record. This result can then be used inside of loc to select the relevant data:

In [24]:
# select meteorites with recclass of L5 only from dataFrame
df = reviews.loc[reviews.recclass == 'L5']

df

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.00,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775000, 6.083330)"
37,Northwest Africa 5815,50693,Valid,L5,256.80,Found,NaN,0.00000,0.00000,"(0.000000, 0.000000)"
59,Ausson,4903,Valid,L5,50000.00,Fell,01/01/1858 12:00:00 AM,43.08333,0.58333,"(43.083330, 0.583330)"
73,Banswal,4937,Valid,L5,14.00,Fell,01/01/1913 12:00:00 AM,30.40000,78.20000,"(30.400000, 78.200000)"
81,Barwell,4954,Valid,L5,44000.00,Fell,01/01/1965 12:00:00 AM,52.56528,-1.33972,"(52.565280, -1.339720)"
...,...,...,...,...,...,...,...,...,...,...
45639,Yamato 984107,40727,Valid,L5,11.92,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45651,Yamato 984135,40755,Valid,L5,28.74,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45654,Yamato 984141,40761,Valid,L5,5.45,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45659,Yamato 984148,40768,Valid,L5,4.59,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45702,Zelfana,31353,Valid,L5,1058.00,Found,01/01/2002 12:00:00 AM,32.15833,4.63333,"(32.158330, 4.633330)"

In [25]:
# select meteorites which have been found in dataframe

reviews.loc[reviews.fall == 'Found']

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
37,Northwest Africa 5815,50693,Valid,L5,256.80,Found,NaN,0.00000,0.00000,"(0.000000, 0.000000)"
1108,Abajo,4,Valid,H5,331.00,Found,01/01/1982 12:00:00 AM,26.80000,-105.41667,"(26.800000, -105.416670)"
1109,Abar al' Uj 001,51399,Valid,H3.8,194.34,Found,01/01/2008 12:00:00 AM,22.72192,48.95937,"(22.721920, 48.959370)"
1110,Abbott,5,Valid,H3-6,21100.00,Found,01/01/1951 12:00:00 AM,36.30000,-104.28333,"(36.300000, -104.283330)"
1111,Abernathy,7,Valid,L6,2914.00,Found,01/01/1941 12:00:00 AM,33.85000,-101.80000,"(33.850000, -101.800000)"
...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.00,Found,01/01/1990 12:00:00 AM,29.03700,17.01850,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.00,Found,01/01/1999 12:00:00 AM,13.78333,8.96667,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.30,Found,01/01/1939 12:00:00 AM,49.25000,17.66667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.00,Found,01/01/2003 12:00:00 AM,49.78917,41.50460,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.00,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333,"(33.983330, -115.683330)"

In [37]:
# use the ampersand (&) to bring the two questions together:

reviews.loc[(reviews.recclass == 'L5') & (reviews.fall == 'Found')]

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
37,Northwest Africa 5815,50693,Valid,L5,256.80,Found,NaN,0.00000,0.00000,"(0.000000, 0.000000)"
1120,Acfer 007,17,Valid,L5,542.00,Found,01/01/1989 12:00:00 AM,27.51667,3.65000,"(27.516670, 3.650000)"
1130,Acfer 017,27,Valid,L5,446.00,Found,01/01/1989 12:00:00 AM,27.73333,4.40000,"(27.733330, 4.400000)"
1163,Acfer 051,61,Valid,L5,905.00,Found,01/01/1989 12:00:00 AM,27.61667,4.41667,"(27.616670, 4.416670)"
1164,Acfer 052,62,Valid,L5,58.00,Found,01/01/1989 12:00:00 AM,27.75000,4.15000,"(27.750000, 4.150000)"
...,...,...,...,...,...,...,...,...,...,...
45639,Yamato 984107,40727,Valid,L5,11.92,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45651,Yamato 984135,40755,Valid,L5,28.74,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45654,Yamato 984141,40761,Valid,L5,5.45,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45659,Yamato 984148,40768,Valid,L5,4.59,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45702,Zelfana,31353,Valid,L5,1058.00,Found,01/01/2002 12:00:00 AM,32.15833,4.63333,"(32.158330, 4.633330)"

In [27]:
# use a pipe (|) for OR operation

reviews.loc[(reviews.recclass == 'L5') | (reviews.fall == 'Found')]

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775000, 6.083330)"
37,Northwest Africa 5815,50693,Valid,L5,256.8,Found,NaN,0.00000,0.00000,"(0.000000, 0.000000)"
59,Ausson,4903,Valid,L5,50000.0,Fell,01/01/1858 12:00:00 AM,43.08333,0.58333,"(43.083330, 0.583330)"
73,Banswal,4937,Valid,L5,14.0,Fell,01/01/1913 12:00:00 AM,30.40000,78.20000,"(30.400000, 78.200000)"
81,Barwell,4954,Valid,L5,44000.0,Fell,01/01/1965 12:00:00 AM,52.56528,-1.33972,"(52.565280, -1.339720)"
...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.03700,17.01850,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.78333,8.96667,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,49.25000,17.66667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,01/01/2003 12:00:00 AM,49.78917,41.50460,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333,"(33.983330, -115.683330)"

Pandas comes with a few built-in conditional selectors, two of which we will highlight here.

The first is isin. isin is lets you select data whose value "is in" a list of values. For example, here's how we can use it to select meteorites recclass L5 or H6

The second is isnull (and its companion notnull). These methods let you highlight values which are (or are not) empty (NaN). For example, to filter out meteorites  lacking a year in the dataset

In [28]:
reviews.loc[reviews.recclass.isin(['L5','H6'])]

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.00,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.00,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.183330, 10.233330)"
36,Andura,2298,Valid,H6,17900.00,Fell,01/01/1939 12:00:00 AM,20.88333,76.86667,"(20.883330, 76.866670)"
37,Northwest Africa 5815,50693,Valid,L5,256.80,Found,NaN,0.00000,0.00000,"(0.000000, 0.000000)"
46,Archie,2329,Valid,H6,5070.00,Fell,01/01/1932 12:00:00 AM,38.50000,-94.30000,"(38.500000, -94.300000)"
...,...,...,...,...,...,...,...,...,...,...
45651,Yamato 984135,40755,Valid,L5,28.74,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45654,Yamato 984141,40761,Valid,L5,5.45,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45655,Yamato 984144,40764,Valid,H6,37.44,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45659,Yamato 984148,40768,Valid,L5,4.59,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45702,Zelfana,31353,Valid,L5,1058.00,Found,01/01/2002 12:00:00 AM,32.15833,4.63333,"(32.158330, 4.633330)"

In [29]:
# Select recllass L5 & LH6 which have been found

reviews.loc[reviews.recclass.isin(['L5','H6']) & (reviews.fall == 'Found')]

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
37,Northwest Africa 5815,50693,Valid,L5,256.80,Found,NaN,0.00000,0.00000,"(0.000000, 0.000000)"
1120,Acfer 007,17,Valid,L5,542.00,Found,01/01/1989 12:00:00 AM,27.51667,3.65000,"(27.516670, 3.650000)"
1125,Acfer 012,22,Valid,H6,98.00,Found,01/01/1989 12:00:00 AM,27.80000,4.16667,"(27.800000, 4.166670)"
1130,Acfer 017,27,Valid,L5,446.00,Found,01/01/1989 12:00:00 AM,27.73333,4.40000,"(27.733330, 4.400000)"
1134,Acfer 021,31,Valid,H6,2140.00,Found,01/01/1989 12:00:00 AM,27.55000,3.61667,"(27.550000, 3.616670)"
...,...,...,...,...,...,...,...,...,...,...
45651,Yamato 984135,40755,Valid,L5,28.74,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45654,Yamato 984141,40761,Valid,L5,5.45,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45655,Yamato 984144,40764,Valid,H6,37.44,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45659,Yamato 984148,40768,Valid,L5,4.59,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.000000, 0.000000)"
45702,Zelfana,31353,Valid,L5,1058.00,Found,01/01/2002 12:00:00 AM,32.15833,4.63333,"(32.158330, 4.633330)"

The second is isnull (and its companion notnull). These methods let you highlight values which are (or are not) empty (NaN). For example, to filter out meteorites  lacking a year in the dataset, here's what we would do:

In [30]:
# filter out meteorites  lacking a year in the dataset
reviews.loc[reviews.year.isnull()]

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
37,Northwest Africa 5815,50693,Valid,L5,256.8,Found,NaN,0.00000,0.00000,"(0.000000, 0.000000)"
3409,Apache Junction,54566,Valid,"Iron, IIIAB",25000.0,Found,NaN,33.45000,-111.51667,"(33.450000, -111.516670)"
3440,Asarco Mexicana,2344,Valid,"Iron, IIIAB",NaN,Found,NaN,NaN,NaN,NaN
4973,Aus,4902,Valid,L,30.2,Found,NaN,-26.66667,16.25000,"(-26.666670, 16.250000)"
5044,Benares (b),5012,Valid,Iron,NaN,Found,NaN,25.33333,83.00000,"(25.333330, 83.000000)"
...,...,...,...,...,...,...,...,...,...,...
38128,Um-Hadid,24114,Valid,Mesosiderite,15400.0,Found,NaN,21.69500,50.59667,"(21.695000, 50.596670)"
38201,Valencia,24147,Valid,H5,33500.0,Found,NaN,39.00000,-0.03333,"(39.000000, -0.033330)"
38224,Villa Regina,53827,Valid,"Iron, IIIAB",5030.0,Found,NaN,-39.10000,-67.06667,"(-39.100000, -67.066670)"
38328,Wiltshire,56143,Valid,H5,92750.0,Found,NaN,51.14967,-1.81000,"(51.149670, -1.810000)"
45700,Zaragoza,48916,Valid,"Iron, IVA-an",162000.0,Found,NaN,41.65000,-0.86667,"(41.650000, -0.866670)"

In [31]:
# filter out meteorites  with a year in the dataset

reviews.loc[reviews.year.notnull()]

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.166670, -64.950000)"
...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.03700,17.01850,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.78333,8.96667,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,49.25000,17.66667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,01/01/2003 12:00:00 AM,49.78917,41.50460,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333,"(33.983330, -115.683330)"